<!-- dflook/terraform-github-actions {"workspace":"tofuenv-2","backend_type":"remote","backend":"9085d8385681327adb321c417ad357dc1fc0b8aadecfc7c290de418e9a6080d8","plan_job_ref":"Job Test Terraform cloud #266 at https://github.com/dflook/terraform-github-actions/actions/runs/12453459370","plan_hash":"5ef25bea99577256a9c26e9962f48238f5f4a3709a285baf6346e184b0133bbc","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __tofuenv-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #266](https://github.com/dflook/terraform-github-actions/actions/runs/12453459370)